<!-- terraform-pr-comment: plan-and-apply -->
### Terraform Plan Results

#### ✅ Plan

<details><summary>Output</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # azuread_application.api[0m will be created
[0m  [32m+[0m[0m resource "azuread_application" "api" {
      [32m+[0m[0m app_role_ids                = (known after apply)
      [32m+[0m[0m application_id              = (known after apply)
      [32m+[0m[0m client_id                   = (known after apply)
      [32m+[0m[0m description                 = "GeoLocation Lookup API"
      [32m+[0m[0m disabled_by_microsoft       = (known after apply)
      [32m+[0m[0m display_name                = "geolocation-api-dev"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m identifier_uris             = [
          [32m+[0m[0m "api://e56a6947-bb9a-4a6e-846a-1f118d1c3a14/geolocation-api-dev",
        ]
      [32m+[0m[0m logo_url                    = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids = (known after apply)
      [32m+[0m[0m object_id                   = (known after apply)
      [32m+[0m[0m prevent_duplicate_names     = true
      [32m+[0m[0m publisher_domain            = (known after apply)
      [32m+[0m[0m sign_in_audience            = "AzureADMyOrg"
      [32m+[0m[0m tags                        = (known after apply)
      [32m+[0m[0m template_id                 = (known after apply)

      [32m+[0m[0m app_role {
          [32m+[0m[0m allowed_member_types = [
              [32m+[0m[0m "Application",
            ]
          [32m+[0m[0m description          = "Allows applications to perform lookup requests"
          [32m+[0m[0m display_name         = "LookupApiUser"
          [32m+[0m[0m enabled              = true
          [32m+[0m[0m id                   = "b4b62713-44f8-4871-8c10-2c85369b776d"
          [32m+[0m[0m value                = "LookupApiUser"
        }

      [32m+[0m[0m feature_tags (known after apply)

      [32m+[0m[0m web {
          [32m+[0m[0m implicit_grant {
              [32m+[0m[0m access_token_issuance_enabled = false
              [32m+[0m[0m id_token_issuance_enabled     = true
            }
        }
    }

[1m  # azuread_application.web[0m will be created
[0m  [32m+[0m[0m resource "azuread_application" "web" {
      [32m+[0m[0m app_role_ids                = (known after apply)
      [32m+[0m[0m application_id              = (known after apply)
      [32m+[0m[0m client_id                   = (known after apply)
      [32m+[0m[0m description                 = "GeoLocation Web front-end"
      [32m+[0m[0m disabled_by_microsoft       = (known after apply)
      [32m+[0m[0m display_name                = "geolocation-web-dev"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m logo_url                    = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids = (known after apply)
      [32m+[0m[0m object_id                   = (known after apply)
      [32m+[0m[0m prevent_duplicate_names     = true
      [32m+[0m[0m publisher_domain            = (known after apply)
      [32m+[0m[0m sign_in_audience            = "AzureADMyOrg"
      [32m+[0m[0m tags                        = (known after apply)
      [32m+[0m[0m template_id                 = (known after apply)

      [32m+[0m[0m feature_tags (known after apply)

      [32m+[0m[0m required_resource_access {
          [32m+[0m[0m resource_app_id = (known after apply)

          [32m+[0m[0m resource_access {
              [32m+[0m[0m id   = "b4b62713-44f8-4871-8c10-2c85369b776d"
              [32m+[0m[0m type = "Role"
            }
        }

      [32m+[0m[0m web {
          [32m+[0m[0m homepage_url  = "https://dev.geo-location.net/"
          [32m+[0m[0m logout_url    = "https://dev.geo-location.net/signout-callback-oidc"
          [32m+[0m[0m redirect_uris = [
              [32m+[0m[0m "https://app-geo-location-web-dev-swedencentral-4be0342a0572.azurewebsites.net/signin-oidc",
              [32m+[0m[0m "https://dev.geo-location.net/signin-oidc",
              [32m+[0m[0m "https://localhost:5001/signin-oidc",
            ]

          [32m+[0m[0m implicit_grant {
              [32m+[0m[0m access_token_issuance_enabled = false
              [32m+[0m[0m id_token_issuance_enabled     = true
            }
        }
    }

[1m  # azuread_application_password.api[0m will be created
[0m  [32m+[0m[0m resource "azuread_application_password" "api" {
      [32m+[0m[0m application_id        = (known after apply)
      [32m+[0m[0m application_object_id = (known after apply)
      [32m+[0m[0m display_name          = (known after apply)
      [32m+[0m[0m end_date              = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m key_id                = (known after apply)
      [32m+[0m[0m rotate_when_changed   = {
          [32m+[0m[0m "rotation" = "2026-02-12T19:10:07Z"
        }
      [32m+[0m[0m start_date            = (known after apply)
      [32m+[0m[0m value                 = (sensitive value)
    }

[1m  # azuread_application_password.web[0m will be created
[0m  [32m+[0m[0m resource "azuread_application_password" "web" {
      [32m+[0m[0m application_id        = (known after apply)
      [32m+[0m[0m application_object_id = (known after apply)
      [32m+[0m[0m display_name          = (known after apply)
      [32m+[0m[0m end_date              = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m key_id                = (known after apply)
      [32m+[0m[0m rotate_when_changed   = {
          [32m+[0m[0m "rotation" = "2026-02-12T19:10:07Z"
        }
      [32m+[0m[0m start_date            = (known after apply)
      [32m+[0m[0m value                 = (sensitive value)
    }

[1m  # azuread_service_principal.api[0m will be created
[0m  [32m+[0m[0m resource "azuread_service_principal" "api" {
      [32m+[0m[0m account_enabled              = true
      [32m+[0m[0m app_role_assignment_required = false
      [32m+[0m[0m app_role_ids                 = (known after apply)
      [32m+[0m[0m app_roles                    = (known after apply)
      [32m+[0m[0m application_id               = (known after apply)
      [32m+[0m[0m application_tenant_id        = (known after apply)
      [32m+[0m[0m client_id                    = (known after apply)
      [32m+[0m[0m display_name                 = (known after apply)
      [32m+[0m[0m homepage_url                 = (known after apply)
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m logout_url                   = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids  = (known after apply)
      [32m+[0m[0m oauth2_permission_scopes     = (known after apply)
      [32m+[0m[0m object_id                    = (known after apply)
      [32m+[0m[0m owners                       = [
          [32m+[0m[0m "e99c0528-886a-4ad1-8c8e-de6f349281f3",
        ]
      [32m+[0m[0m redirect_uris                = (known after apply)
      [32m+[0m[0m saml_metadata_url            = (known after apply)
      [32m+[0m[0m service_principal_names      = (known after apply)
      [32m+[0m[0m sign_in_audience             = (known after apply)
      [32m+[0m[0m tags                         = (known after apply)
      [32m+[0m[0m type                         = (known after apply)

      [32m+[0m[0m feature_tags (known after apply)

      [32m+[0m[0m features (known after apply)
    }

[1m  # azuread_service_principal.web[0m will be created
[0m  [32m+[0m[0m resource "azuread_service_principal" "web" {
      [32m+[0m[0m account_enabled              = true
      [32m+[0m[0m app_role_assignment_required = false
      [32m+[0m[0m app_role_ids                 = (known after apply)
      [32m+[0m[0m app_roles                    = (known after apply)
      [32m+[0m[0m application_id               = (known after apply)
      [32m+[0m[0m application_tenant_id        = (known after apply)
      [32m+[0m[0m client_id                    = (known after apply)
      [32m+[0m[0m display_name                 = (known after apply)
      [32m+[0m[0m homepage_url                 = (known after apply)
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m logout_url                   = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids  = (known after apply)
      [32m+[0m[0m oauth2_permission_scopes     = (known after apply)
      [32m+[0m[0m object_id                    = (known after apply)
      [32m+[0m[0m owners                       = [
          [32m+[0m[0m "e99c0528-886a-4ad1-8c8e-de6f349281f3",
        ]
      [32m+[0m[0m redirect_uris                = (known after apply)
      [32m+[0m[0m saml_metadata_url            = (known after apply)
      [32m+[0m[0m service_principal_names      = (known after apply)
      [32m+[0m[0m sign_in_audience             = (known after apply)
      [32m+[0m[0m tags                         = (known after apply)
      [32m+[0m[0m type                         = (known after apply)

      [32m+[0m[0m feature_tags (known after apply)

      [32m+[0m[0m features (known after apply)
    }

[1m  # azurerm_api_management_api_policy.legacy_api_policy[0m will be created
[0m  [32m+[0m[0m resource "azurerm_api_management_api_policy" "legacy_api_policy" {
      [32m+[0m[0m api_management_name = "apim-geo-location-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m api_name            = "geolocation-api-legacy"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m resource_group_name = "rg-geo-location-dev-swedencentral"
      [32m+[0m[0m xml_content         = <<-EOT
            <policies>
              <inbound>
                  <base/>
                  <set-backend-service backend-id="app-geo-location-api-dev-swedencentral-4be0342a0572" />
                  <set-variable name="rewriteUriTemplate" value="@(&quot;/v1&quot; + context.Request.OriginalUrl.Path.Substring(context.Api.Path.Length))" />
                  <rewrite-uri template="@((string)context.Variables[&quot;rewriteUriTemplate&quot;])" />
              </inbound>
              <backend>
                  <forward-request />
              </backend>
              <outbound>
                  <base/>
              </outbound>
              <on-error />
            </policies>
        EOT
    }

[1m  # azurerm_api_management_api_policy.versioned_api_policy["v1"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_api_management_api_policy" "versioned_api_policy" {
      [32m+[0m[0m api_management_name = "apim-geo-location-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m api_name            = "geolocation-api-v1"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m resource_group_name = "rg-geo-location-dev-swedencentral"
      [32m+[0m[0m xml_content         = <<-EOT
            <policies>
              <inbound>
                  <base/>
                  <set-backend-service backend-id="app-geo-location-api-dev-swedencentral-4be0342a0572" />
                  <set-variable name="rewriteUriTemplate" value="@((string)context.Request.OriginalUrl.Path.Substring(context.Api.Path.Length))" />
                  <rewrite-uri template="@((string)context.Variables["rewriteUriTemplate"])" />
              </inbound>
              <backend>
                  <forward-request />
              </backend>
              <outbound>
                  <base/>
              </outbound>
              <on-error />
            </policies>
        EOT
    }

[1m  # azurerm_api_management_backend.api_backend[0m will be created
[0m  [32m+[0m[0m resource "azurerm_api_management_backend" "api_backend" {
      [32m+[0m[0m api_management_name = "apim-geo-location-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m description         = "Backend for GeoLocation Lookup API"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "app-geo-location-api-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m protocol            = "http"
      [32m+[0m[0m resource_group_name = "rg-geo-location-dev-swedencentral"
      [32m+[0m[0m title               = "app-geo-location-api-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m url                 = (known after apply)

      [32m+[0m[0m tls {
          [32m+[0m[0m validate_certificate_chain = true
          [32m+[0m[0m validate_certificate_name  = true
        }
    }

[1m  # azurerm_api_management_product_policy.api_product_policy[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_api_management_product_policy" "api_product_policy" {
        id                  = "/subscriptions/d68448b0-9947-46d7-8771-baa331a3063a/resourceGroups/rg-geo-location-dev-swedencentral/providers/Microsoft.ApiManagement/service/apim-geo-location-dev-swedencentral-4be0342a0572/products/geolocation-api"
      [33m~[0m[0m xml_content         = <<-EOT
          [31m-[0m[0m <policies>
          [32m+[0m[0m <policies>
          [31m-[0m[0m 	<inbound>
          [32m+[0m[0m   <inbound>
          [31m-[0m[0m 		<base />
          [32m+[0m[0m       <base/>
          [31m-[0m[0m 		<cache-lookup vary-by-developer="false" vary-by-developer-groups="false" downstream-caching-type="none" />
          [32m+[0m[0m       <cache-lookup vary-by-developer="false" vary-by-developer-groups="false" downstream-caching-type="none" />
          [31m-[0m[0m 		<validate-jwt header-name="Authorization" failed-validation-httpcode="401" failed-validation-error-message="JWT validation was unsuccessful" require-expiration-time="true" require-scheme="Bearer" require-signed-tokens="true">
          [32m+[0m[0m       <validate-jwt header-name="Authorization" failed-validation-httpcode="401" failed-validation-error-message="JWT validation was unsuccessful" require-expiration-time="true" require-scheme="Bearer" require-signed-tokens="true">
          [31m-[0m[0m 			<openid-config url="https://login.microsoftonline.com/e56a6947-bb9a-4a6e-846a-1f118d1c3a14/v2.0/.well-known/openid-configuration" />
          [32m+[0m[0m           <openid-config url="https://login.microsoftonline.com/e56a6947-bb9a-4a6e-846a-1f118d1c3a14/v2.0/.well-known/openid-configuration" />
          [31m-[0m[0m 			<audiences>
          [32m+[0m[0m           <audiences>
          [31m-[0m[0m 				<audience>api://geolocation-api-dev</audience>
          [32m+[0m[0m           <audience>api://e56a6947-bb9a-4a6e-846a-1f118d1c3a14/geolocation-api-dev</audience>
          [31m-[0m[0m 			</audiences>
          [32m+[0m[0m           </audiences>
          [31m-[0m[0m 			<issuers>
          [32m+[0m[0m           <issuers>
          [31m-[0m[0m 				<issuer>https://sts.windows.net/e56a6947-bb9a-4a6e-846a-1f118d1c3a14/</issuer>
          [32m+[0m[0m               <issuer>https://sts.windows.net/e56a6947-bb9a-4a6e-846a-1f118d1c3a14/</issuer>
          [31m-[0m[0m 			</issuers>
          [32m+[0m[0m           </issuers>
          [31m-[0m[0m 			<required-claims>
          [32m+[0m[0m           <required-claims>
          [31m-[0m[0m 				<claim name="roles" match="any">
          [32m+[0m[0m               <claim name="roles" match="any">
          [31m-[0m[0m 					<value>LookupApiUser</value>
          [32m+[0m[0m                 <value>LookupApiUser</value>
          [31m-[0m[0m 				</claim>
          [32m+[0m[0m               </claim>
          [31m-[0m[0m 			</required-claims>
          [32m+[0m[0m           </required-claims>
          [31m-[0m[0m 		</validate-jwt>
          [32m+[0m[0m       </validate-jwt>
          [31m-[0m[0m 	</inbound>
          [32m+[0m[0m   </inbound>
          [31m-[0m[0m 	<backend>
          [32m+[0m[0m   <backend>
          [31m-[0m[0m 		<forward-request />
          [32m+[0m[0m       <forward-request />
          [31m-[0m[0m 	</backend>
          [32m+[0m[0m   </backend>
          [31m-[0m[0m 	<outbound>
          [32m+[0m[0m   <outbound>
          [31m-[0m[0m 		<base />
          [32m+[0m[0m       <base/>
          [31m-[0m[0m 		<cache-store duration="3600" />
          [32m+[0m[0m       <cache-store duration="3600" />
          [31m-[0m[0m 	</outbound>
          [32m+[0m[0m   </outbound>
          [31m-[0m[0m 	<on-error />
          [32m+[0m[0m   <on-error />
            </policies>
        EOT
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_app_service_certificate_binding.web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_app_service_certificate_binding" "web" {
      [32m+[0m[0m app_service_name    = (known after apply)
      [32m+[0m[0m certificate_id      = (known after apply)
      [32m+[0m[0m hostname            = (known after apply)
      [32m+[0m[0m hostname_binding_id = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m ssl_state           = "SniEnabled"
      [32m+[0m[0m thumbprint          = (known after apply)
    }

[1m  # azurerm_app_service_custom_hostname_binding.web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_app_service_custom_hostname_binding" "web" {
      [32m+[0m[0m app_service_name    = "app-geo-location-web-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m hostname            = "dev.geo-location.net"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m resource_group_name = "rg-platform-hosting-dev-swedencentral"
      [32m+[0m[0m ssl_state           = (known after apply)
      [32m+[0m[0m thumbprint          = (known after apply)
      [32m+[0m[0m virtual_ip          = (known after apply)
    }

[1m  # azurerm_app_service_managed_certificate.web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_app_service_managed_certificate" "web" {
      [32m+[0m[0m canonical_name             = (known after apply)
      [32m+[0m[0m custom_hostname_binding_id = (known after apply)
      [32m+[0m[0m expiration_date            = (known after apply)
      [32m+[0m[0m friendly_name              = (known after apply)
      [32m+[0m[0m host_names                 = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m issue_date                 = (known after apply)
      [32m+[0m[0m issuer                     = (known after apply)
      [32m+[0m[0m subject_name               = (known after apply)
      [32m+[0m[0m thumbprint                 = (known after apply)
    }

[1m  # azurerm_dns_cname_record.web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_dns_cname_record" "web" {
      [32m+[0m[0m fqdn                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "dev"
      [32m+[0m[0m record              = "app-geo-location-web-dev-swedencentral-4be0342a0572.azurewebsites.net"
      [32m+[0m[0m resource_group_name = "rg-platform-dns-prd-uksouth-01"
      [32m+[0m[0m ttl                 = 300
      [32m+[0m[0m zone_name           = "geo-location.net"
    }

[1m  # azurerm_dns_txt_record.web_verification[0m will be created
[0m  [32m+[0m[0m resource "azurerm_dns_txt_record" "web_verification" {
      [32m+[0m[0m fqdn                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "asuid.dev"
      [32m+[0m[0m resource_group_name = "rg-platform-dns-prd-uksouth-01"
      [32m+[0m[0m ttl                 = 300
      [32m+[0m[0m zone_name           = "geo-location.net"

      [32m+[0m[0m record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

[1m  # azurerm_key_vault.kv[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "kv" {
      [32m+[0m[0m access_policy                 = (known after apply)
      [32m+[0m[0m enable_rbac_authorization     = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "swedencentral"
      [32m+[0m[0m name                          = "kv-4be0342a0572"
      [32m+[0m[0m public_network_access_enabled = true
      [32m+[0m[0m rbac_authorization_enabled    = true
      [32m+[0m[0m resource_group_name           = "rg-geo-location-dev-swedencentral"
      [32m+[0m[0m sku_name                      = "standard"
      [32m+[0m[0m soft_delete_retention_days    = 90
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "DeployedBy"  = "GitHub-Terraform"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Git"         = "https://github.com/frasermolyneux/geo-location"
          [32m+[0m[0m "Workload"    = "geo-location"
        }
      [32m+[0m[0m tenant_id                     = "e56a6947-bb9a-4a6e-846a-1f118d1c3a14"
      [32m+[0m[0m vault_uri                     = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls (known after apply)
    }

[1m  # azurerm_key_vault_secret.api_client_id[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "api_client_id" {
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "geolocation-api-dev-clientid"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.api_client_secret[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "api_client_secret" {
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "geolocation-api-dev-clientsecret"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.consumer_apim_key["portal2-repository-func-dev"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "consumer_apim_key" {
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/d68448b0-9947-46d7-8771-baa331a3063a/resourceGroups/rg-geo-location-dev-swedencentral/providers/Microsoft.KeyVault/vaults/kv-fec0cd315122"
      [32m+[0m[0m name                    = "portal2-repository-func-dev-apim-subscription-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.consumer_apim_key["portal2-web-dev"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "consumer_apim_key" {
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/d68448b0-9947-46d7-8771-baa331a3063a/resourceGroups/rg-geo-location-dev-swedencentral/providers/Microsoft.KeyVault/vaults/kv-0847951f48cc"
      [32m+[0m[0m name                    = "portal2-web-dev-apim-subscription-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.storage_connection_string[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "storage_connection_string" {
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "sageolocdevd9efb7-connectionstring"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.web_apim_subscription_key[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "web_apim_subscription_key" {
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "app-geo-location-web-dev-swedencentral-4be0342a0572-apim-subscription-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_linux_web_app.api[0m will be created
[0m  [32m+[0m[0m resource "azurerm_linux_web_app" "api" {
      [32m+[0m[0m app_settings                                   = {
          [32m+[0m[0m "APPINSIGHTS_PROFILERFEATURE_VERSION"        = "1.0.0"
          [32m+[0m[0m "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          [32m+[0m[0m "ASPNETCORE_ENVIRONMENT"                     = "Development"
          [32m+[0m[0m "ApplicationInsightsAgent_EXTENSION_VERSION" = "~3"
          [32m+[0m[0m "AzureAd__Audience"                          = "api://e56a6947-bb9a-4a6e-846a-1f118d1c3a14/geolocation-api-dev"
          [32m+[0m[0m "AzureAd__ClientId"                          = "@Microsoft.KeyVault(VaultName=kv-4be0342a0572;SecretName=geolocation-api-dev-clientid)"
          [32m+[0m[0m "AzureAd__ClientSecret"                      = "@Microsoft.KeyVault(VaultName=kv-4be0342a0572;SecretName=geolocation-api-dev-clientsecret)"
          [32m+[0m[0m "AzureAd__Instance"                          = "https://login.microsoftonline.com/"
          [32m+[0m[0m "AzureAd__TenantId"                          = "e56a6947-bb9a-4a6e-846a-1f118d1c3a14"
          [32m+[0m[0m "DiagnosticServices_EXTENSION_VERSION"       = "~3"
          [32m+[0m[0m "WEBSITE_RUN_FROM_PACKAGE"                   = "1"
          [32m+[0m[0m "appdata_storage_connectionstring"           = "@Microsoft.KeyVault(VaultName=kv-4be0342a0572;SecretName=sageolocdevd9efb7-connectionstring)"
          [32m+[0m[0m "maxmind_apikey"                             = "@Microsoft.KeyVault(VaultName=kv-4be0342a0572;SecretName=maxmind-apikey)"
          [32m+[0m[0m "maxmind_userid"                             = "@Microsoft.KeyVault(VaultName=kv-4be0342a0572;SecretName=maxmind-userid)"
        }
      [32m+[0m[0m client_affinity_enabled                        = false
      [32m+[0m[0m client_certificate_enabled                     = false
      [32m+[0m[0m client_certificate_mode                        = "Required"
      [32m+[0m[0m custom_domain_verification_id                  = (sensitive value)
      [32m+[0m[0m default_hostname                               = (known after apply)
      [32m+[0m[0m enabled                                        = true
      [32m+[0m[0m ftp_publish_basic_authentication_enabled       = true
      [32m+[0m[0m hosting_environment_id                         = (known after apply)
      [32m+[0m[0m https_only                                     = true
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m key_vault_reference_identity_id                = (known after apply)
      [32m+[0m[0m kind                                           = (known after apply)
      [32m+[0m[0m location                                       = "swedencentral"
      [32m+[0m[0m name                                           = "app-geo-location-api-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m outbound_ip_address_list                       = (known after apply)
      [32m+[0m[0m outbound_ip_addresses                          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_address_list              = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses                 = (known after apply)
      [32m+[0m[0m public_network_access_enabled                  = true
      [32m+[0m[0m resource_group_name                            = "rg-platform-hosting-dev-swedencentral"
      [32m+[0m[0m service_plan_id                                = "/subscriptions/d68448b0-9947-46d7-8771-baa331a3063a/resourceGroups/rg-platform-hosting-dev-swedencentral/providers/Microsoft.Web/serverFarms/asp-platform-hosting-dev-swedencentral-default"
      [32m+[0m[0m site_credential                                = (sensitive value)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "DeployedBy"  = "GitHub-Terraform"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Git"         = "https://github.com/frasermolyneux/geo-location"
          [32m+[0m[0m "Workload"    = "geo-location"
        }
      [32m+[0m[0m virtual_network_backup_restore_enabled         = false
      [32m+[0m[0m vnet_image_pull_enabled                        = false
      [32m+[0m[0m webdeploy_publish_basic_authentication_enabled = true
      [32m+[0m[0m zip_deploy_file                                = (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                               = true
          [32m+[0m[0m container_registry_use_managed_identity = false
          [32m+[0m[0m default_documents                       = (known after apply)
          [32m+[0m[0m detailed_error_logging_enabled          = (known after apply)
          [32m+[0m[0m ftps_state                              = "Disabled"
          [32m+[0m[0m health_check_eviction_time_in_min       = 5
          [32m+[0m[0m health_check_path                       = "/api/health"
          [32m+[0m[0m http2_enabled                           = false
          [32m+[0m[0m ip_restriction_default_action           = "Allow"
          [32m+[0m[0m linux_fx_version                        = (known after apply)
          [32m+[0m[0m load_balancing_mode                     = "LeastRequests"
          [32m+[0m[0m local_mysql_enabled                     = false
          [32m+[0m[0m managed_pipeline_mode                   = "Integrated"
          [32m+[0m[0m minimum_tls_version                     = "1.2"
          [32m+[0m[0m remote_debugging_enabled                = false
          [32m+[0m[0m remote_debugging_version                = (known after apply)
          [32m+[0m[0m scm_ip_restriction_default_action       = "Allow"
          [32m+[0m[0m scm_minimum_tls_version                 = "1.2"
          [32m+[0m[0m scm_type                                = (known after apply)
          [32m+[0m[0m scm_use_main_ip_restriction             = false
          [32m+[0m[0m use_32_bit_worker                       = true
          [32m+[0m[0m vnet_route_all_enabled                  = false
          [32m+[0m[0m websockets_enabled                      = false
          [32m+[0m[0m worker_count                            = (known after apply)

          [32m+[0m[0m application_stack {
              [32m+[0m[0m dotnet_version = "9.0"
            }
        }
    }

[1m  # azurerm_linux_web_app.web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_linux_web_app" "web" {
      [32m+[0m[0m app_settings                                   = (known after apply)
      [32m+[0m[0m client_affinity_enabled                        = false
      [32m+[0m[0m client_certificate_enabled                     = false
      [32m+[0m[0m client_certificate_mode                        = "Required"
      [32m+[0m[0m custom_domain_verification_id                  = (sensitive value)
      [32m+[0m[0m default_hostname                               = (known after apply)
      [32m+[0m[0m enabled                                        = true
      [32m+[0m[0m ftp_publish_basic_authentication_enabled       = true
      [32m+[0m[0m hosting_environment_id                         = (known after apply)
      [32m+[0m[0m https_only                                     = true
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m key_vault_reference_identity_id                = (known after apply)
      [32m+[0m[0m kind                                           = (known after apply)
      [32m+[0m[0m location                                       = "swedencentral"
      [32m+[0m[0m name                                           = "app-geo-location-web-dev-swedencentral-4be0342a0572"
      [32m+[0m[0m outbound_ip_address_list                       = (known after apply)
      [32m+[0m[0m outbound_ip_addresses                          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_address_list              = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses                 = (known after apply)
      [32m+[0m[0m public_network_access_enabled                  = true
      [32m+[0m[0m resource_group_name                            = "rg-platform-hosting-dev-swedencentral"
      [32m+[0m[0m service_plan_id                                = "/subscriptions/d68448b0-9947-46d7-8771-baa331a3063a/resourceGroups/rg-platform-hosting-dev-swedencentral/providers/Microsoft.Web/serverFarms/asp-platform-hosting-dev-swedencentral-default"
      [32m+[0m[0m site_credential                                = (sensitive value)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "DeployedBy"  = "GitHub-Terraform"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Git"         = "https://github.com/frasermolyneux/geo-location"
          [32m+[0m[0m "Workload"    = "geo-location"
        }
      [32m+[0m[0m virtual_network_backup_restore_enabled         = false
      [32m+[0m[0m vnet_image_pull_enabled                        = false
      [32m+[0m[0m webdeploy_publish_basic_authentication_enabled = true
      [32m+[0m[0m zip_deploy_file                                = (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                               = true
          [32m+[0m[0m container_registry_use_managed_identity = false
          [32m+[0m[0m default_documents                       = (known after apply)
          [32m+[0m[0m detailed_error_logging_enabled          = (known after apply)
          [32m+[0m[0m ftps_state                              = "Disabled"
          [32m+[0m[0m http2_enabled                           = false
          [32m+[0m[0m ip_restriction_default_action           = "Allow"
          [32m+[0m[0m linux_fx_version                        = (known after apply)
          [32m+[0m[0m load_balancing_mode                     = "LeastRequests"
          [32m+[0m[0m local_mysql_enabled                     = false
          [32m+[0m[0m managed_pipeline_mode                   = "Integrated"
          [32m+[0m[0m minimum_tls_version                     = "1.2"
          [32m+[0m[0m remote_debugging_enabled                = false
          [32m+[0m[0m remote_debugging_version                = (known after apply)
          [32m+[0m[0m scm_ip_restriction_default_action       = "Allow"
          [32m+[0m[0m scm_minimum_tls_version                 = "1.2"
          [32m+[0m[0m scm_type                                = (known after apply)
          [32m+[0m[0m scm_use_main_ip_restriction             = false
          [32m+[0m[0m use_32_bit_worker                       = true
          [32m+[0m[0m vnet_route_all_enabled                  = false
          [32m+[0m[0m websockets_enabled                      = false
          [32m+[0m[0m worker_count                            = (known after apply)

          [32m+[0m[0m application_stack {
              [32m+[0m[0m dotnet_version = "9.0"
            }
        }
    }

[1m  # azurerm_role_assignment.api_kv_secrets_user[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "api_kv_secrets_user" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.consumer_kv_deploy_secrets_officer["portal2-repository-func-dev"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "consumer_kv_deploy_secrets_officer" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e99c0528-886a-4ad1-8c8e-de6f349281f3"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets Officer"
      [32m+[0m[0m scope                            = "/subscriptions/d68448b0-9947-46d7-8771-baa331a3063a/resourceGroups/rg-geo-location-dev-swedencentral/providers/Microsoft.KeyVault/vaults/kv-fec0cd315122"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.consumer_kv_deploy_secrets_officer["portal2-web-dev"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "consumer_kv_deploy_secrets_officer" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e99c0528-886a-4ad1-8c8e-de6f349281f3"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets Officer"
      [32m+[0m[0m scope                            = "/subscriptions/d68448b0-9947-46d7-8771-baa331a3063a/resourceGroups/rg-geo-location-dev-swedencentral/providers/Microsoft.KeyVault/vaults/kv-0847951f48cc"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.deploy_kv_secrets_officer[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "deploy_kv_secrets_officer" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e99c0528-886a-4ad1-8c8e-de6f349281f3"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets Officer"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.web_kv_secrets_user[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "web_kv_secrets_user" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # time_sleep.wait_for_hostname_binding[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "wait_for_hostname_binding" {
      [32m+[0m[0m create_duration = "60s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m [0m29 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  [32m+[0m[0m api_app_name                    = "app-geo-location-api-dev-swedencentral-4be0342a0572"
  [32m+[0m[0m entra_api_application_client_id = (known after apply)
  [32m+[0m[0m entra_web_application_client_id = (known after apply)
  [32m+[0m[0m key_vault_name                  = "kv-4be0342a0572"
  [32m+[0m[0m web_app_name                    = "app-geo-location-web-dev-swedencentral-4be0342a0572"
```

</details>

